Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/analysis.po
Languages: fr

source: In this module, the function *get_dataset* retrieves a synthetic (fake) dataset. The class *Results* offers a few functions to summarize and merge the data, as well as assess preparedness for retirement.
fr: Dans ce module, la fonction *get_dataset* récupère un jeu de données (simulé). La classe *Results* offre quelques fonctions pour résumer et fusionner les données et pour évaluer la préparation pour la retraite.

source: Function that returns a dataframe of synthetic data.
fr: Fonction qui renvoie un dataframe de données synthétiques.

source: Dataframe of synthetic data.
fr: Dataframe de données synthétiques.

source: This class prepares the results.
fr: Cette classe prépare les résultats.

source: dataframe of inputs
fr: dataframe d'intrants

source: dataframe of outputs
fr: dataframe d'extrants

source: instance of the class Common
fr: instance de la classe Common

source: instance of the class Prices
fr: instance de la classe Prices

source: dictionary of extra parameters
fr: dictionnaire de paramètres supplémentaires

source: Function to summarize the simulation.
fr: Fonction pour résumer la simulation.

source: Function to merge input and output variables to create a database.
fr: Fonction pour fusionner les variables d'entrée et de sortie pour créer une base de données.

source: add index to database, True by default
fr: ajouter l'indice à la base de données, True (Vrai) par défaut

source: Function that introduces a consumption floor, computes RRI (NaN if consumption before and after retirement below cons_floor), and checks preparedness for retirement.
fr: Fonction qui introduit un plancher de consommation, calcule l'IPR (NaN si la consommation avant et après la retraite sont en deçà de cons_floor), et vérifie la préparation pour la retraite.

source: factor to normalize income for couple, by default 2
fr: facteur de normalisation du revenu pour les couples, par défaut 2

source: consumption floor, by default 100
fr: plancher de consommation, par défaut 100

source: cutoffs, by default {20: 80, 100: 65}
fr: seuils, par défaut {20: 80, 100: 65}
