Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/annuities.po
Languages: fr

source: This module contains the functions needed to convert all financial assets into annuities upon retirement (of the first and/or the second spouse). One of the functions calls the annuity factor built using the Life module.
fr: Ce module contient les fonctions requises pour convertir tous les actifs financiers en rentes au moment de la retraite (du premier et/ou du deuxième conjoint). Une des fonctions appelle le facteur de rente construit à l'aide du module Life.

source: Function that partially converts assets into annuities when the first spouse retires, using the other functions below.
fr: Fonction qui convertit partiellement les actifs en rentes au moment de la retraite du premier conjoint, en utilisant les autres fonctions ci-dessous.

source: household
fr: ménage

source: dictionary of returns
fr: dictionnaire de rendements

source: year
fr: année

source: instance of the class Prices
fr: instance de la classe Prices

source: Function that fully converts assets into annuities when the last spouse retires, using the other functions below.
fr: Fonction qui convertit entièrement les actifs en rentes au moment de la retraite du dernier conjoint, à l'aide des autres fonctions ci-dessous.

source: Function to liquidate financial assets.
fr: Fonction qui liquide les actifs financiers.

source: instance of the class Person
fr: instance de la classe Person

source: Function to compute an individual factor for annuities constant in real terms.
fr: Fonction calculant un facteur individuel pour les rentes constant en termes réels.

source: We use an adjusted rate to dampen excess factor volatility. This is because we take the total return on bonds in the year that the annuity is purchased. Ideally, the whole interest structure should be used instead, such that mean reversion would smooth out annuity prices.
fr: Nous utilisons un taux ajusté pour amenuiser toute volatilité excédentaire du facteur, car nous prenons le rendement total sur les obligations de LT dans l'année d'achat de la rente. Idéalement, la structure complète des taux d'intérêt devrait plutôt être utilisée, de telle sorte que le retour à la moyenne lisserait le prix des rentes.

source: interest rate
fr: taux d'intérêt

source: Function that converts assets to annuities in real terms.
fr: Fonction qui convertit les actifs en rentes en termes réels.
