Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/assets.po
Languages: fr

source: This module manages all assets using various classes and functions: pension plans, individual savings (registered and unregistered), housing, business assets. It uses the contributions and room used as inputs as well as returns generated in the Macro module, and it updates all asset-related variables as the simulation progresses.
fr: À l'aide de plusieurs classes et fonctions, ce module gère tous les actifs: régimes de retraite, épargne individuelle (enregistrée et non enregistrée), logement, entreprises. Il utilise les cotisations et l'espace entrés comme inputs ainsi que les rendements générés dans le module Macro. Il met à jour toutes les variables reliées aux actifs à mesure que la simulation progresse.

source: This class manages contribution room for TFSAs and RRSPs.
fr: Cette classe gère l'espace de cotisation aux CELI et aux REER.

source: All amounts are nominal.
fr: Tous les montants sont nominaux.

source: initial RRSP contribution room available
fr: espace de cotisation REER initialement disponible

source: initial TFSA contribution room available
fr: espace de cotisation CELI initialement disponible

source: Function to update contribution room for RRSPs and TFSAs, using the 2 other functions below (which themselves call the other functions of the class).
fr: Fonction qui met à jour l'espace de cotisation pour les REER et les CELI, en utilisant les 2 autres fonctions ci-dessous (qui elles-mêmes appellent les autres fonctions de la classe).

source: instance of the class Person
fr: instance de la classe Person

source: year
fr: année

source: instance of the class Common
fr: instance de la classe Common

source: instance of the class Prices
fr: instance de la classe Prices

source: Function to update RRSP contribution room.
fr: Fonction qui met à jour l'espace de cotisation REER.

source: Function to update TFSA contribution room.
fr: Fonction qui met à jour l'espace de cotisation CELI.

source: Function to adjust RRSP contribution room to DB RPP contributions.
fr: Fonction qui ajuste l'espace de cotisation REER en fonction des cotisations aux RPA à PD.

source: Function to adjust RRSP contribution room to DC RPP contributions.
fr: Fonction qui ajuste l'espace de cotisation REER en fonction des cotisations aux RPA à CD.

source: If contribution room is insufficent for the intended/planned RRSP contributions, the "excess" contributions are channeled to TFSA.
fr: Si l'espace de cotisation est insuffisant pour les cotisations REER prévues / planifiées, les cotisations "excédentaires" sont dirigées vers le CELI.

source: Function to compute employee contributions to DC RPPs (later used to caculate taxes).
fr: Fonction qui calcule les cotisations d'employé aux RPA à CD (utilisées plus tard afin de calculer les impôts).

source: Function to adjust RRSP contribution for contributions other than to RPPs.
fr: Fonction qui ajuste l'espace de cotisation REER en fonction des cotisations autres qu'à des RPA.

source: type of account
fr: type de compte

source: Function to adjust TFSA contribution room to TFSA contributions (including "excess" DC RPP and RRSP contributions).
fr: Fonction qui ajuste l'espace de cotisation CELI en fonction des cotisations CELI (y compris les cotisations "excédentaires" aux REER et aux RPA à CD).

source: If contribution room is insufficent for the intended/planned TFSA contributions, the "excess" contributions are channeled to unregistered accounts.
fr: Si l'espace de cotisation est insuffisant pour les cotisations CELI prévues / planifiées, les cotisations "excédentaires" sont dirigées vers des comptes non enregistrés.

source: Function to adjust DC RPP and RRSP accounts to mandatory RRIF withdrawals (RRIFs are not separately modelled in this version).
fr: Fonction qui ajuste les comptes REER et RPA à CD en fonction des retraits obligatoires aux FERR (les FERR ne sont pas modélisés séparément dans cette version).

source: Nominal amount that needs to be withdrawn.
fr: Montant nominal qui doit être retiré.

source: Function to adjust contributions to unregistered accounts for "excess" TFSA contributions channeled to them.
fr: Fonction qui ajuste les cotisations aux comptes non enregistrés en fonction des cotisations CELI "excédentaires" qui sont dirigées vers eux.

source: Reset RRSP and TFSA contribution rooms to their inital values.
fr: Remet les espaces de cotisation REER et CELI à leurs valeurs initiales.

source: This class manages registered accounts. All amounts are nominal.
fr: Cette classe gère les comptes enregistrés. Tous les montants sont nominaux.

source: household
fr: ménage

source: Function to update the balance to account for contributions, withdrawals, and returns.
fr: Fonction qui met à jour le solde pour tenir compte des cotisations, des retraits et des rendements.

source: dictionary of returns
fr: dictionnaire de rendements

source: Function to compute the rate of return given the mix of assets in the account.
fr: Fonction qui calcule le taux de rendement étant donné la composition des actifs dans le compte.

source: Rate of return (net of fees).
fr: Taux de rendement (net de frais).

source: Function to manage mandatory RRIF withdrawals.
fr: Fonction gérant les retraits obligatoires aux FERR.

source: Amount of mandatory withdrawal.
fr: Montant du retrait obligatoire.

source: Function to liquidate an account, setting balance, contributions and withdrawals to zero.
fr: Fonction qui liquide le compte et met le solde, les cotisations et les retraits à zéro.

source: Amount from liquidation (before taxes).
fr: Montant de la liquidation (avant impôts).

source: Reset the balance and withdrawal to its initial balance.
fr: Remet le solde et les retraits à leur valeur initiale.

source: This class manages unregistered accounts.
fr: Cette classe gère les comptes non enregistrés.

source: Function to update the balance for contributions, withdrawals and returns.
fr: Fonction qui met à jour le solde en fonction des cotisations, retraits et rendements.

source: Function to compute new capital gains and taxable income (dividends and interests).
fr: Fonction qui calcule les nouveaux gains en capital et le revenu imposable de dividendes et d'intérêts.

source: Function that computes the rate of return given the mix of assets in account.
fr: Fonction qui calcule le taux de rendement étant donné la composition d'actifs dans le compte.

source: Function to update to balance and separate between non-taxable funds (i.e. previous post-tax balance), capital gains, dividends, and interests.
fr: Fonction qui met à jour le solde et distingue les fonds non imposables (c.-à-d. le solde antérieur après impôts), les gains en capital, les dividendes et les intérêts.

source: Function to separate a withdrawal from the balance at the end of the period, and separately identify non-taxable funds, capital gains, dividends, and interests.
fr: Fonction qui sépare un retrait du solde à la fin de la période et identifie séparément les fonds non imposables, les gains en capital, les dividendes et les intérêts.

source: Function to adjust investment income (dividends and interests) for withdrawals.
fr: Fonction qui ajuste le revenu d'investissement (dividendes et intérêts) en fonction des retraits.

source: Function to compute capital losses from previous years used for deduction against capital gains, and adjust realized capital losses accordingly.
fr: Fonction qui calcule les perts en capital d'années antérieures utilisées comme déduction contre des gains en capital, et ajuste en conséquence les pertes en capital réalisées.

source: capital gains
fr: gains en capital

source: Capital losses (to be deducted).
fr: Pertes en capital (à déduire).

source: Function that adjusts the final balance for withdrawals, dividends and interests.
fr: Fonction qui ajuste le solde final en fonction des retraits, dividendes et intérêts.

source: Function to liquidate the account and adjust capital losses.
fr: Fonction qui liquide le compte et ajuste les pertes en capital.

source: Function to reset the balance, capital gains, and withdrawals to their initial values.
fr: Fonction qui remet à leur valeur initiale le solde, les gains en capital et les retraits.

source: This class manages DC RPPs.
fr: Cette classe gère les RPA à CD.

source: This class manages DB RPPs.
fr: Cette classe gère les RPA à PD.

source: Function that computes RPP DB benefits and adjusts them for CPP/QPP integration.
fr: Fonction qui calcule les prestations de RPA à PD et les ajuste pour tenir compte de l'intégration au RPC/RRQ.

source: If RPP benefits are smaller than CPP/QPP benefits, RPP benefits are set to zero once the receipt of CPP/QPP retirement benefits begins.
fr: Si les prestations de RPA sont plus faibles que les prestations de RPC/RRQ, les prestations de RPA sont fixées à zéro une fois que débutent les prestations de retraite du RPC/RRQ.

source: Function to compute a penalty for individuals who begin to receive DB RPP benefits "early", i.e. before they accumulate the maximum number of years of service, if they are younger than the age at which benefits can start without penalty (the "early retirement age").
fr: Fonction qui calcule une pénalité pour les individus débutant leurs prestations de RPA à PD de façpn "hâtive", c.-à-d. avant d'avoir accumulé le nombre maximal d'années de service, s'ils sont plus jeunes que l'âge auquel les prestations peuvent débuter sans pénalité ("l'âge de retraite anticipée").

source: By default, the penalty applies to those who begin RPP benefits receipt before reaching 35 years of service and before age 62. These values can be modified.
fr: Par défaut, la pénalité s'applique aux individus qui débutent leurs prestations avant d'avoir atteint 35 années de service et avant 62 ans. Ces valeurs peuvent être modifiées.

source: Function to compute an adjustment (reduction) to DB RPP benefits to account for CPP/QPP integration.
fr: Fonction qui calcule un ajustement (une réduction) des prestations de RPA à PD pour tenir compte de l'intégration avec le RPC/RRQ.

source: Amount of benefit adjustment for CPP/QPP integration.
fr: Montant de l'ajustement pour l'intégration au RPC/RRQ.

source: Function that resets the benefits and contribution rates to their initial values.
fr: Fonction qui remet à leur valeur initiale les prestations et taux de cotisation.

source: This class manages housing and residences.
fr: Cette classe gère le logement et les résidences.

source: dictionary containing values of residences
fr: dictionnaire contenant les valeurs des résidences

source: primary or secondary residence
fr: résidence principale ou secondaire

source: Function to update the balance (residence values) for growth in price.
fr: Fonction qui met à jour le solde (les valeurs des résidences) en fonction de la croissance du prix.

source: nominal return to housing (capital gains)
fr: rendement nominal sur le logement (gains en capital)

source: Function to liquidate the asset, compute capital gains if they apply, and set balance to zero.
fr: Fonction qui liquide l'actif, calcule les gains en capital si applicable, et fixe le solde à zéro.

source: Amount from asset liquidation (before taxes).
fr: Montant de la liquidation d'actif (avant impôts).

source: Function to reset residence value to its initial value and set capital gains to zero.
fr: Fonction qui remet la valeur de la résidence à sa valeur initiale et fixe les gains en capital à zéro.

source: Function to compute imputed rent.
fr: Fonction qui calcule le loyer imputé.

source: This class manages a business (as an asset owned by the houshehold).
fr: Cette classe gère une entreprise (comme un actif détenu par le ménage).

source: dictionary containing value of business
fr: dictionnaire contenant la valeur de l'entreprise

source: Function to update the balance and dividends.
fr: Fonction qui met à jour le solde et les dividendes.

source: returns on business assets
fr: rendements sur les actifs d'entreprise

source: Function to liquidate account (business assets), compute capital gains, and set balance to zero.
fr: Fonction qui liquide le compte (actifs d'entreprise), calcule les gains en capital et fixe le solde à zéro.

source: Selling price of the business assets.
fr: Prix de vente des actifs d'entreprise.

source: Reset business value and capital gains to their initial values.
fr: Remet à leur valeur initiale la valeur de l'entreprise et les gains en capital.
