Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/balance_sheets.po
Languages: fr

source: This module holds functions that compute the various balance sheet items for each household at different points in the simulation process. A collection of variables are calculated in real terms (base year 2018) and added to the output dataframe retrieved by the module *main*.
fr: Ce module contient des fonctions qui calculent les différents éléments du bilan pour chaque ménage à différents moments du processus de simulation. Un ensemble de variables sont calculées en termes réels (avec 2018 comme année de base) et ajoutées au dataframe d'output récupéré par le module *main*.

source: At age 55 or in the year preceding retirement, if the latter occurs before age 56, wages, consumption, earlier pensions, account balances (RRSP, other registered, TFSA and unregistered accounts, as well as DC RPPs) are calculated. They are stored in variables ending with '_bef'.
fr: À 55 ans ou dans l'année précédant la retraite, si cette dernière se produit avant 56 ans, les salaires, la consommation, les pensions antérieures et les soldes des comptes (REER, autres comptes enregistrés, CELI et comptes non enregistrés, ainsi que RPA à CD) sont calculés. Ils sont entreposés dans des variables dont le nom se termine par '_bef'.

source: At age 65 or in the year of retirement, if the latter occurs later, consumption; earlier pensions; annuities purchased with financial assets (balances); DB RPP, CPP/QPP, and OAS/GIS/Allowances benefits; as well as the values of residences and outstanding mortgages, are stored in variables ending with '_aft'.
fr: À 65 ans ou dans l'année de la retraite, si cette dernière se produit plus tard, la consommation; les pensions antérieures; les rentes achetées avec les (soldes des) actifs financiers; les prestations de RPA à PD, de RPC/RRQ et de PSV/SRG/Allocations; ainsi que les valeurs des résidences et les soldes hypothécaires sont entreposés dans des variables dont le nom se termine par '_aft'.

source: For couples who do not retire at the same time, wages, earlier pensions, account balances and annuities of the first spouse to retire are calculated. They are stored in variables ending with '_part'. Variables describing the spouse who retires last begin with 's\_'.
fr: Pour les couples qui ne prennent pas leur retraite en même temps, les salaires, les pensions antérieures, les soldes de comptes et les rentes du premier conjoint à prendre sa retraite sont calculés. Ils sont entreposés dans des variables dont le nom se termine par '_part'. Le nom des variables décrivant le conjoint qui prend sa retraite en dernier débute avec 's\_'.

source: Function to compute the pre-retirement balance sheet.
fr: Fonction qui calcule le bilan avant la retraite.

source: household
fr: ménage

source: year
fr: année

source: instance of the class Common
fr: instance de la classe Common

source: instance of the class Prices
fr: instance de la classe Prices

source: Function to compute pre-retirement consumption.
fr: Fonction qui calcule la consommation avant la retraite.

source: Function to compute the post-retirement balance sheet.
fr: Fonction qui calcule le bilan après la retraite.

source: Function to extract output variables.
fr: Fonction qui extrait les variables d'output.
