Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/debts.po
Languages: fr

source: The Debts module manages debts (payments and balances) in the simulation.
fr: Le module Debts gère les dettes (paiements et soldes) dans la simulation.

source: This class manages all debts. All amounts are nominal.
fr: Cette classe gère toutes les dettes. Tous les montants sont nominaux.

source: name of the debt
fr: nom de la dette

source: dictionary containing debt initial balances and monthly payments
fr: dictionnaire contenant les soldes initiaux des dettes et les paiements mensuels

source: instance of the class Common
fr: instance de la classe Common

source: instance of the class Prices
fr: instance de la classe Prices

source: Estimate the term of the debt.
fr: Estime le terme de la dette.

source: term of the debt
fr: durée de la dette

source: Updates yearly payment and balance.
fr: Met à jour le paiement annuel et le solde.

source: year
fr: année

source: interest rate
fr: taux d'intérêt

source: Reset balance and term to initial values.
fr: Remet le solde et la durée à leur valeur initiale.
