Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/initialisation.po
Languages: fr

source: This module sets up households and attaches assets and debts to them. The table below shows all the individual inputs to the CPR (some of them are entered in other modules).
fr: Ce module configure des ménages et leur attache des actifs et des dettes. Le tableau ci-dessous montre tous les intrants individuels au CPR (certains sont entrés dans d'autres modules).

source: Though an example input file is provided as part of the package, a tutorial is also offered to show users how to modify those inputs to use the ones of their choice. NOTE: users must be careful when using their inputs, as a general error message will be generated if any of the -- numerous -- inputs is incorrectly specified (i.e. contains a mistake or is highly implausible).
fr: Bien qu'un fichier exemple d'intrants soit fourni avec le package, un tutoriel est également offert afin de montrer aux utilisateurs comment modifier ces intrants afin d'utiliser ceux de leur choix. NOTE: il faut être prudent lorsque l'on utilise ses propres intrants, car un message d'erreur général sera généré si l'un des -- nombreux -- intrants est spécifié de manière incorrecte (c.-à-d. qu'il contient une erreur ou est très peu plausible).

source: Function that creates a household with one or two persons and attaches assets and debts.
fr: Fonction qui crée un ménage avec une ou deux personnes et y attache des actifs et des dettes.

source: household index
fr: indice du ménage

source: dictionary of household features
fr: dictionnaire de caractéristiques des ménages

source: instance of the class Common
fr: instance de la classe Common

source: instance of the class Prices
fr: innstance de la classe Prices

source: Instance of the class Hhold.
fr: Instance de la classe Hhold.

source: This class creates a person.
fr: Cette classe crée une personne.

source: dictionary containing all informations about households
fr: dictionnaire contenant toutes les informations à propos des ménages

source: list of features attached to spouses
fr: liste des caractéristiques attachées aux conjoints

source: False for head of household, True otherwise
fr: Faux pour le chef de ménage, Vrai sinon

source: Function that creates wage profiles for each realisation of uncertainty, to be used when the stochastic version of the tool is selected.
fr: Fonction qui crée des profils de salaires pour chaque réalisation de l'incertitude, utilisée lorsque la version stochastique de l'outil est sélectionnée.

source: Wage profiles.
fr: Profils de salaires.

source: length of the time series
fr: longueur de la série temporelle

source: number of realisations
fr: nombre de réalisations

source: Time series of shocks to the wage.
fr: Série temporelle de chocs sur le salaire.

source: This class creates a household.
fr: Cette classe crée un ménage.

source: list of features attached to the household
fr: liste de caractéristiques attachées au ménage

source: first spouse
fr: premier conjoint

source: second spouse (in the case of a couple)
fr: deuxième conjoint (pour les couples)

source: Function that sets years of partial and full retirement as well as years in which pre-retirement and post-retirement consumptions are assessed.
fr: Fonction qui fixe les années de retraite partielle et complète (pour les couples) ainsi que les années dans lesquelles la consommation avant et après la retraite sont évaluées.
