Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/macro.po
Languages: fr

source: The Macro module contains classes that contain parameters common to all households, generate stochastic processes for returns and wages and other prices.
fr: Le module Macro contient des classes qui contiennent des paramètres communs à tous les ménages; et qui génèrent des processus stochastiques pour les rendements, les salaires et les autres prix.

source: This class sets and contains the parameters common to all households.
fr: Cette classe fixe et contient les paramètres communs à tous les ménages.

source: number of simulations
fr: nombre de simulations

source: True if non stochastic simulation, False otherwise
fr: Vrai s'il s'agit d'une simulation stochastique, Faux sinon

source: dictionary of extra parameters
fr: dictionnaire de paramètres supplémentaires

source: Set contributions limits for RRSP and TFSA.
fr: Fixer les limites de cotisation pour les REER et les CELI.

source: RRSP or TFSA
fr: RRSP (REER) ou TFSA (CELI)

source: " Pre-reform ympe used to adjust DB benefits for CPP
fr: MGAP pré-réforme utilisé pour ajuster les prestations de PD pour le RPC

source: Set percentages for cpp/qpp benefits.
fr: Fixer des pourcentages pour les prestations de RPC/RRQ.

source: This class computes the times series for asset returns, interest rates on debt, deterministic wage profiles, housing price growth rate and price/rent ratio.
fr: Cette classe calcule la série temporelle pour les rendements sur actifs, les taux d'intérêt sur les dettes, les profils de salaires déterministes, la croissance des prix immobiliers et le ratio prix-loyers.

source: instance of the class Common
fr: instance de la classe Common

source: Simulate N series of length T nominal returns distributed lognormally with autocorrelation rho.
fr: Simuler N séries de longueur T de rendements nominaux distribués de façon log-normale, avec une autocorrélation rho.

source: type of asset
fr: type d'actif

source: Array of nominal returns
fr: Tableau de rendements nominaux

source: Convert arithmetic mean mu and volatility sigma of the returns and autocorrelation rho of the log returns into :math:`\alpha`, :math:`\rho` and :math:`\sigma_{\epsilon}` of the process:
fr: Convertit la moyenne arithmétique mu et la volatilité sigma des rendements et l'autocorrélation rho du log des rendements en :math:`\alpha`, :math:`\rho` and :math:`\sigma_{\epsilon}` dans le processus:

source: :math:`\ln(1+r_t) = \alpha + \rho * \ln(1+r_{t-1}) + \epsilon`, where :math:`\epsilon \sim N(0, \sigma_{\epsilon})`.
fr: :math:`\ln(1+r_t) = \alpha + \rho * \ln(1+r_{t-1}) + \epsilon`, où :math:`\epsilon \sim N(0, \sigma_{\epsilon})`.

source: arithmetic mean
fr: moyenne artihmétique

source: autocorrelation :math:
fr: autocorrélation

source: standard deviation
fr: écart-type

source: * *float* -- AR(1) coefficient (:math:`\alpha`) * *float* -- Standard deviation of error term (:math:`\sigma_{\epsilon}`)
fr: * *float* -- coefficient AR(1) (:math:`\alpha`) * *float* -- Écart-type du terme d'erreur (:math:`\sigma_{\epsilon}`)

source: *float* -- AR(1) coefficient (:math:`\alpha`)
fr: *float* -- coefficient AR(1) (:math:`\alpha`)

source: *float* -- Standard deviation of error term (:math:`\sigma_{\epsilon}`)
fr: *float* -- Écart-type du terme d'erreur (:math:`\sigma_{\epsilon}`)

source: Simulate series of nominal housing price growth (in :math:`\ln(1+r)` form) and price-rent ratio.
fr: Simule une série de croissance nominale des prix immobiliers (sous la forme :math:`\ln(1+r)`) et de une série de ratio prix-loyers.

source: * *numpy.array* -- Array of nominal housing price growth * *numpy.array* -- Array of price-rent ratios
fr: * *numpy.array* -- Tableau (array) de croissance nominale des prix immobiliers * *numpy.array* -- Tableau (array) de ratios prix-loyers

source: *numpy.array* -- Array of nominal housing price growth
fr: *numpy.array* -- Tableau (array) de croissance nominale des prix immobiliers

source: *numpy.array* -- Array of price-rent ratios
fr: *numpy.array* -- Tableau (array) de ratios prix-loyers

source: Compute inflation factors with base year 2018.
fr: Calcule les facteurs d'inflation, avec 2018 comme année de base.

source: Dictionary of inflation factors for each year
fr: Dictionnaire de facteurs d'inflation pour chaque année

source: Creates N series of yearly nominal interest rate of length T for each type of debt
fr: Crée N séries de longueur T de taux d'intérêt annuel nominal pour chaque type de dette

source: Dictionary of interest rates by type of debt and year
fr: Dictionnaire de taux d'intérêt par type de dette et par année

source: Creates a dictionary of differences in log wages by education and age.
fr: Crée un dictionnaire de différences dans le log des salaires par scolarité et par âge.

source: Dictionary of difference in log wages by education and age
fr: Dictionnaire de différences dans le log des salaires par scolarité et par âge

source: This function creates an instance of life.table by gender and province.
fr: Cette fonction crée une instance de life.table par genre et par province.

source: dictionary of annuity factors by gender and provinces
fr: dictionnaire de facteurs de rentes par genre et par province
