Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/overview.po
Languages: fr

source: Getting Started With the CPR
fr: Premiers pas avec le CPR

source: The CPR and the other tools it uses (SRD and SRPP) are written in Python, a modern, simple and fast language. In order to use it, it is essential to ensure first that an up-to-date Python distribution is installed, for example using Anaconda. In all cases, the minimum requirements to use the CPR are Python 3.6+ with *numpy*, *pandas* and *xlrd*. Although not essential, it will also be useful to have a minimal understanding of Python environments and, if possible, vocabulary (e.g. function, class, instance, profile).
fr: Le CPR et les autres outils qu'il utilise (le SRD et le SRPP) sont écrits en Python, un langage simple, rapide et moderne. Afin de pouvoir l’utiliser, il faut s’assurer d’avoir au préalable installé une distribution à jour de Python, par exemple à l’aide d’Anaconda. Dans tous les cas, les exigences minimales pour utiliser le CPR sont Python 3.6+ avec *numpy*, *pandas* et *xlrd*. Bien que ce ne soit pas essentiel, il sera également utile de se familiariser un minimum, au préalable, avec les environnements et le vocabulaire Python (p.ex. fonction, classe, instance, profil).

source: Installing the CPR
fr: Installation du CPR

source: The CPR can be easily installed using pip::
fr: On peut installer facilement le CPR en utilisant pip::

source: Please read the `terms of use <https://pypi.org/policy/terms-of-use/>`_ for *pypi*, the website hosting the package.
fr: Veuillez lire les `conditions d'utilisation (en anglais) <https://pypi.org/policy/terms-of-use/>`_ de *pypi*, le site Web qui héberge le package.

source: The CPR uses two other packages that are produced by the RSI and the Research Chair on Intergenerational Economics (CREEi), which is supported by the RSI: the Disposable Income Simulator (`Simulateur de revenu disponible, or SRD <https://creei-models.github.io/srd/>`_; documentation in French), which computes taxes and major benefits; and the Public Pension Plans Simulator (`Simulateur de régimes de pensions publiques, or SRPP <https://creei-models.github.io/srpp/>`_; documentation in French), which simulates QPP and CPP contributions and benefits. Both the SRD and the SRPP are automatically installed along with the CPR.
fr: Le CPR utilise deux autres packages produits par l'IRE et la Chaire de recherche sur les enjeux économiques intergénérationnels (CRREi), soutenue par l'IRE: le `Simulateur de revenu disponible (SRD) <https://creei-models.github.io/srd/>`_, qui calcule les impôts et les principales prestations; et le `Simulateur de régimes de pensions publiques <https://creei-models.github.io/srpp/>`_, qui simule les cotisations et les prestations de RRQ et de RPC. Tant le SRD que le SRPP sont installés automatiquement en même temps que le CPR.

source: In a notebook or a project, the CPR is called by adding the following command:
fr: Dans un notebook ou un projet, on invoque le CPR en ajoutant la commande suivante:

source: To uninstall the CPR, the SRD and the SRPP, pip can be used::
fr: Pour désinstaller le CPR, le SRD et le SRPP, il suffit d’utiliser pip::

source: Alternative Install
fr: Installation alternative

source: If one is unable to install the CPR, a zip file containing CPR and its dependencies, SRD and SRPP, can be downloaded from `Github <https://github.com/rsi-models/CPR/releases>`_ (choose the file CPR_with_dep.zip in the latest release). To start using the CPR, it suffices to unzip the file in the directory of your choice and either work from that directory or add the directory to the path (for example by using the module *sys*). A jupyter notebook explaining how CPR works, *Tutorial CPR*, is also included in the zip file. If one does not want the CPR anymore, the *cpr*, *srd* and *srpp* folders can simply be deleted.
fr: Si l’on est dans l'impossibilité d'installer le CPR, un fichier zip contenant le CPR et ses dépendances, le SRD et le SRPP, peut être téléchargé de `Github <https://github.com/rsi-models/CPR/releases>`_ (choisir le fichier CPR_with_dep.zip dans le plus récent « release »). Pour utiliser le CPR, il suffit d’extraire les fichiers du zip dans le répertoire de son choix et de travailler de ce dernier ou d’ajouter ce répertoire au chemin d’accès (par exemple en utilisant le module *sys*). Un notebook jupyter qui explique le fonctionnement du CPR, *Tutorial CPR*, est également inclus dans le fichier zip. Si l’on ne veut plus le CPR, il suffit d’effacer les répertoires *cpr*, *srd* et *srpp*.

source: For further details on how to use the CPR, please consult the :ref:`tutorial` section.
fr: Pour plus de détails la manière d'utiliser le CPR, veuillez consulter la section :ref:`tutoriel <tutorial>`.

source: As mentioned elsewhere, note the CPR is provided "as is" under `an MIT license <https://rsi-models.github.io/CPR/credits.html#licence>`_.
fr: Tel que mentionné ailleurs, le CPR est fourni « tel quel », sous une `licence MIT <https://rsi-models.github.io/CPR/credits.html#licence>`_.

source: If you have questions, comments or suggestions, do not hesitate to :ref:`contact us <nous_contacter>`.
fr: En cas de questions, commentaires ou suggestions, n’hésitez pas à :ref:`nous_contacter`.
