Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/simulator.po
Languages: fr

source: This module runs the simulations.
fr: Ce module fait tourner les simulations.

source: Function that projects assets, RPPs and debts until the time of retirement.
fr: Fonction projetant les actifs, les RPA et les dettes jusqu'au moment de la retraite.

source: instance of the class Hhold and simulation number
fr: instance de la classe Hhold et numéro de simulation

source: instance of the class Common
fr: instance de la classe Common

source: instance of the class Prices
fr: instance de la classe Prices

source: dictionary containing households' characteristics before and after retirement
fr: dictionnaire contenant les caractéristiques des ménages avant et après la retraite

source: simulation number
fr: numéro de simulation

source: * *dict* -- returns on assets * *dict* -- price-rent ratio
fr: * *dict* -- rendements sur les actifs * *dict* -- ratio prix-loyers

source: *dict* -- returns on assets
fr: *dict* -- rendements sur les actifs

source: *dict* -- price-rent ratio
fr: *dict* -- ratio prix-loyers

source: Function that attaches wage profiles to individuals.
fr: Fonction qui rattache des profils de revenus de travail aux individus.

source: instance of the class Person
fr: instance de la classe Person

source: Function that creates a CPP/QPP account and enters past CPP/QPP contributions based on past wages.
fr: Fonction qui crée un compte RPC/RRQ et entre les cotisations passées au RPC/RRQ sur la base des revenus de travail passés.

source: Function that computes age for a given year.
fr: Fonction qui calcule l'âge pour une année donnée.

source: year
fr: année

source: Function that updates debt payments and balances.
fr: Fonction qui met à jour les paiements sur les dettes ainsi que les soldes.

source: Function that adjusts contributions to all account types (RRSP, other registered, TFSA) and to pensions plans (DC and DB RPPs) so as to respect available contribution rooms.
fr: Fonction qui ajuste les cotisations à tous les types de comptes (REER, autres comptes enregistrés, CELI) et aux régimes de retraite (RPA à CD et à PD) de manière à respecter les espaces de cotisation disponibles.

source: Function that updates assets every year.
fr: Fonction qui met à jour les actifs chaque année.

source: dictionary of returns
fr: dictionnaire de rendements

source: Function that manages the liquidation of assets upon retirement.
fr: Fonction gérant la liquidation des actifs au moment de la retraite.

source: Function that records CPP/QPP contributions.
fr: Fonction qui enregistre les cotisations au RPC/RRQ.

source: Function to claim CPP/QPP benefits.
fr: Fonction pour faire débuter les prestations de RPC/RRQ.

source: Function that checks whether there are taxable returns to assets.
fr: Fonction qui vérifie s'il y a des rendements imposables sur les actifs.

source: True or False
fr: Vrai ou Faux

source: Function to check whether there are liquidated assets to be taxed.
fr: Fonction qui vérifie s'il y a des actifs liquidés à imposer.

source: Function to prepare the variables used in the SRD (in nominal terms).
fr: Fonction qui prépare les variables utilisées dans le SRD (en termes nominaux)

source: Function to retrieve assets for social assistance asset test.
fr: Fonction pour récupérer les actifs aux fins du test d'actifs de l'aide sociale.

source: instance of class Common
fr: instance de la classe Common

source: Compute rpp (DB and pension).
fr: Calcul des RPA (PD et pension).

source: function converting to nominal value
fr: Fonction convertissant en valeur nominale

source: Function that computes annual CPP/QPP retirement benefits.
fr: Fonction qui calcule les prestations de retraite annuelles de RPC/RRQ.

source: s1 is the part of the supplementary benefit due to higher contribution rates in the 2019-2025 expansion; s2 is the part of the supplementary benefits attributable to changes in the YMPE; and PRB is for post-retirement benefits (for individuals who keep working after claiming -- this feature is not used in the CPR, since individuals automatically claim in the year they retire).
fr: s1 est la portion des prestations supplémentaires liée à un taux de cotisation supérieur dans le cadre de l'expansion 2019-2025; s2 est la portion des prestations supplémentaires liée aux changements dans le MGAP; et PRB est le supplément à la rente de retraite (pour les individus qui continuent à travailler après le début de leur rente -- cette aspect n'est pas utilisé dans le CPR, puisque les individus débutent automatiquement leurs prestations dans l'année de leur retraite).

source: Function that computes RRSP income from withdrawals.
fr: Fonction qui calcule le revenu de retrait de REER.

source: Function that computes other taxable income.
fr: Fonction calculant les autres revenus imposables.

source: Function that computes other non-taxable income.
fr: Fonction calculant les autres revenus non imposables.

source: Function that computes contributions to registered and unregistered accounts (including DC and DB RPP).
fr: Fonction calculant les cotisations aux comptes enregistrés et non enregistrés (incluant les RPA à CD et à PD).

source: Function that resets all variables to their initial values.
fr: Fonction qui rétablit les valeurs initiales de toutes les variables.
