Repository: rsi-models/CPR
Catalog: doc_source/source/locale/*/LC_MESSAGES/tools.po
Languages: fr

source: Tools
fr: Outils

source: In this module, several functions, used in the rest of the code, are available to create dictionaries, modify parameters, or convert prices, among other aspects.
fr: Dans ce module, plusieurs fonctions utilisées dans le reste du code sont disponibles pour créer des dictionnaires, modifier des paramètres ou convertir des prix, entre autres aspects.

source: Function to create a dictionary from a .csv file.
fr: Fonction pour créer un dictionnaire à partir d'un fichier .csv.

source: csv file
fr: fichier csv

source: numerical key, by default False
fr: clé numérique, par défaut à Faux

source: Dictionary of parameters.
fr: Dictionnaire de paramètres.

source: Function to add parameters to a class instance.
fr: Fonction pour ajouter des paramètres à une instance de la classe.

source: class instance
fr: instance de classe

source: Function to update the value of some parameters in inst with values form *extra_params*.
fr: Fonction qui met à jour la valeur de certains paramètres dans inst avec des valeurs prises dans *extra_params*.

source: parameters
fr: paramètres

source: parameters to be updated and their new values
fr: paramètres à mettre à jour ainsi que leurs nouvelles valeurs

source: Creation of a function to convert prices from real to nominal and from nominal to real, with base year 2018.
fr: Création d'une fonction convertissant les prix de réels à nominaux et de nominaux à réels, avec 2018 comme année de base.

source: year
fr: année

source: instance of the class Prices
fr: instance de la classe Prices

source: * *function* -- Function converting nominal to real. * *function* -- Function converting real to nominal.
fr: * *function* -- Fonction convertissant le nominal en réel. * *function* -- Fonction convertissant le réel en nominal.

source: *function* -- Function converting nominal to real.
fr: *function* -- Fonction convertissant le nominal en réel.

source: *function* -- Function converting real to nominal.
fr: *function* -- Fonction convertissant le réel en nominal.

source: Creation of a function that converts prices from real to nominal, with base year 2018. Used for some specific purposes elsewhere in the code.
fr: Création d'une fonction convertissant les prix de réels à nominaux, avec 2018 comme année de base, utilisée à certaines fins spécifiques ailleurs dans le code.

source: Function converting real to nominal.
fr: Fonction convertissant le réel en nominal.

source: Creation of a function that converts prices from nominal to real, with base year 2018.
fr: Création d'une fonction convertissant les prix de nominaux à réels, avec 2018 comme année de base.

source: function converting nominal to real
fr: fonction convertissant le nominal en réel
